{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/erinmarkiewitz/Dropbox/Phd_Coursework/Econ675/hw4\results\pset4_stata.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Nov 2018, 11:40:24
{txt}
{com}. 
. ****
. * Question 1
. ****
. ****
. * Question 2
. ****
. clear all
{res}{txt}
{com}. set seed 12345
{txt}
{com}. scalar n1 = 185
{txt}
{com}. scalar n0 = 260
{txt}
{com}. scalar n2 = 2490
{txt}
{com}. import delimited using LaLonde_all.csv, clear 
{res}{text}(12 vars, 2,935 obs)

{com}. gen log_re74 = log(re74 + 1)
{txt}
{com}. gen log_re75 = log(re75 + 1)
{txt}
{com}. gen age2 = age^2
{txt}
{com}. gen age3 = age^3
{txt}
{com}. gen educ2 = educ^2
{txt}
{com}. gen black_u74 = black*u74
{txt}
{com}. gen educ_log_re74 = educ*log_re74
{txt}
{com}. 
. local covars_a = "age educ black hisp  married nodegr log_re74 log_re75"
{txt}
{com}. local covars_b = "age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75"
{txt}
{com}. local covars_c = "age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75 age3 black_u74 educ_log_re74"
{txt}
{com}. 
. 
. *initialize matricies (0) Experimental data, (2) PSID Control
. 
. mat ate0 = J(19,4,.) 
{txt}
{com}. mat att0 = J(19,4,.) 
{txt}
{com}. mat ate2 = J(19,4,.) 
{txt}
{com}. mat att2 = J(19,4,.) 
{txt}
{com}. 
. *diff in means 
. reg re78 treat if treat ==1 | treat == 0, hc2

{txt}Linear regression                               Number of obs     = {res}       445
                                                {txt}F(1, 443)         =  {res}     7.15
                                                {txt}Prob > F          = {res}    0.0078
                                                {txt}R-squared         = {res}    0.0178
                                                {txt}Root MSE          =    {res} 6579.5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Robust HC2
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2} 1794.342{col 26}{space 2} 670.9965{col 37}{space 1}    2.67{col 46}{space 3}0.008{col 54}{space 4} 475.6105{col 67}{space 3} 3113.074
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4554.801{col 26}{space 2} 340.0931{col 37}{space 1}   13.39{col 46}{space 3}0.000{col 54}{space 4} 3886.405{col 67}{space 3} 5223.197
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mat ate0[1,1] = _b[treat]
{txt}
{com}. mat ate0[1,2] = _se[treat]
{txt}
{com}. mat ate0[1,3] = ate0[1,1] - _se[treat] * 1.96
{txt}
{com}. mat ate0[1,4] = ate0[1,1] + _se[treat] * 1.96
{txt}
{com}. 
. mat att0[1,1] = _b[treat]
{txt}
{com}. mat att0[1,2] = _se[treat]
{txt}
{com}. mat att0[1,3] = att0[1,1] - _se[treat] * 1.96
{txt}
{com}. mat att0[1,4] = att0[1,1] + _se[treat] * 1.96
{txt}
{com}. 
. reg re78 treat if treat ==1 | treat == 2, hc2

{txt}Linear regression                               Number of obs     = {res}     2,675
                                                {txt}F(1, 2673)        =  {res}   535.46
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0609
                                                {txt}Root MSE          =    {res}  15152

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Robust HC2
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2} 15204.78{col 26}{space 2} 657.0763{col 37}{space 1}   23.14{col 46}{space 3}0.000{col 54}{space 4} 13916.35{col 67}{space 3} 16493.21
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-8855.634{col 26}{space 2}  1198.11{col 37}{space 1}   -7.39{col 46}{space 3}0.000{col 54}{space 4}-11204.95{col 67}{space 3}-6506.317
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mat ate2[1,1] = - _b[treat]
{txt}
{com}. mat ate2[1,2] = _se[treat]
{txt}
{com}. mat ate2[1,3] = ate2[1,1] - _se[treat] * 1.96
{txt}
{com}. mat ate2[1,4] = ate2[1,1] + _se[treat] * 1.96
{txt}
{com}. 
. mat att2[1,1] = - _b[treat]
{txt}
{com}. mat att2[1,2] = _se[treat]
{txt}
{com}. mat att2[1,3] = att2[1,1] - _se[treat] * 1.96
{txt}
{com}. mat att2[1,4] = att2[1,1] + _se[treat] * 1.96
{txt}
{com}. 
. 
. 
. 
. *OLS
. local base_count = 2
{txt}
{com}. foreach num of numlist 0 2 {c -(} 
{txt}  2{com}. local count = `base_count'
{txt}  3{com}. 
. foreach cv in a b c {c -(} 
{txt}  4{com}. di "`covars_`cv''"
{txt}  5{com}. di "`num'"
{txt}  6{com}. reg re78 treat `covars_`cv'' if treat ==1 | treat == `num', hc2
{txt}  7{com}. mat ate`num'[`count',1] = _b[treat] * (1 - `num') // stata thinks 2 is treatment
{txt}  8{com}. mat ate`num'[`count',2] = _se[treat]
{txt}  9{com}. mat ate`num'[`count',3] = ate`num'[`count',1] - _se[treat] * 1.96
{txt} 10{com}. mat ate`num'[`count',4] = ate`num'[`count',1] + _se[treat] * 1.96
{txt} 11{com}. 
. mat att`num'[`count',1] = _b[treat] * (1 - `num') // stata thinks 2 is treatment
{txt} 12{com}. mat att`num'[`count',2] = _se[treat]
{txt} 13{com}. mat att`num'[`count',3] = att`num'[`count',1] - _se[treat] * 1.96
{txt} 14{com}. mat att`num'[`count',4] = att`num'[`count',1] + _se[treat] * 1.96
{txt} 15{com}. 
. local ++count 
{txt} 16{com}. {c )-}
{txt} 17{com}. {c )-}
age educ black hisp  married nodegr log_re74 log_re75
0

{txt}Linear regression                               Number of obs     = {res}       445
                                                {txt}F(9, 435)         =  {res}     2.71
                                                {txt}Prob > F          = {res}    0.0045
                                                {txt}R-squared         = {res}    0.0533
                                                {txt}Root MSE          =    {res} 6518.7

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Robust HC2
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2} 1582.167{col 26}{space 2} 659.2457{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4} 286.4638{col 67}{space 3}  2877.87
{txt}{space 9}age {c |}{col 14}{res}{space 2} 57.34591{col 26}{space 2} 41.52001{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-24.25887{col 67}{space 3} 138.9507
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 365.2424{col 26}{space 2} 191.8249{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-11.77646{col 67}{space 3} 742.2613
{txt}{space 7}black {c |}{col 14}{res}{space 2}-2096.123{col 26}{space 2} 1023.588{col 37}{space 1}   -2.05{col 46}{space 3}0.041{col 54}{space 4}-4107.916{col 67}{space 3}-84.32896
{txt}{space 8}hisp {c |}{col 14}{res}{space 2} 208.1657{col 26}{space 2} 1382.826{col 37}{space 1}    0.15{col 46}{space 3}0.880{col 54}{space 4}-2509.686{col 67}{space 3} 2926.017
{txt}{space 5}married {c |}{col 14}{res}{space 2}-21.97075{col 26}{space 2} 896.6707{col 37}{space 1}   -0.02{col 46}{space 3}0.980{col 54}{space 4}-1784.316{col 67}{space 3} 1740.375
{txt}{space 6}nodegr {c |}{col 14}{res}{space 2}-172.4926{col 26}{space 2} 1020.321{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}-2177.864{col 67}{space 3} 1832.879
{txt}{space 4}log_re74 {c |}{col 14}{res}{space 2}-58.00441{col 26}{space 2} 167.7616{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-387.7286{col 67}{space 3} 271.7197
{txt}{space 4}log_re75 {c |}{col 14}{res}{space 2} 171.7824{col 26}{space 2}  169.842{col 37}{space 1}    1.01{col 46}{space 3}0.312{col 54}{space 4}-162.0305{col 67}{space 3} 505.5953
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1000.029{col 26}{space 2} 3274.849{col 37}{space 1}    0.31{col 46}{space 3}0.760{col 54}{space 4}-5436.465{col 67}{space 3} 7436.523
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75
0

{txt}Linear regression                               Number of obs     = {res}       445
                                                {txt}F(13, 431)        =  {res}     1.93
                                                {txt}Prob > F          = {res}    0.0254
                                                {txt}R-squared         = {res}    0.0596
                                                {txt}Root MSE          =    {res} 6527.3

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Robust HC2
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2} 1506.901{col 26}{space 2} 657.3147{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4}   214.96{col 67}{space 3} 2798.842
{txt}{space 9}age {c |}{col 14}{res}{space 2} 139.3818{col 26}{space 2} 251.9654{col 37}{space 1}    0.55{col 46}{space 3}0.580{col 54}{space 4} -355.852{col 67}{space 3} 634.6156
{txt}{space 8}educ {c |}{col 14}{res}{space 2}-1326.888{col 26}{space 2} 1319.435{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-3920.216{col 67}{space 3} 1266.441
{txt}{space 7}black {c |}{col 14}{res}{space 2} -2137.36{col 26}{space 2} 1039.482{col 37}{space 1}   -2.06{col 46}{space 3}0.040{col 54}{space 4}-4180.446{col 67}{space 3} -94.2749
{txt}{space 8}hisp {c |}{col 14}{res}{space 2}   224.29{col 26}{space 2} 1423.181{col 37}{space 1}    0.16{col 46}{space 3}0.875{col 54}{space 4}-2572.948{col 67}{space 3} 3021.528
{txt}{space 5}married {c |}{col 14}{res}{space 2}-200.8963{col 26}{space 2}  899.765{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-1969.369{col 67}{space 3} 1567.577
{txt}{space 6}nodegr {c |}{col 14}{res}{space 2} 813.5505{col 26}{space 2} 1377.213{col 37}{space 1}    0.59{col 46}{space 3}0.555{col 54}{space 4}-1893.339{col 67}{space 3}  3520.44
{txt}{space 4}log_re74 {c |}{col 14}{res}{space 2} 185.3944{col 26}{space 2} 738.2174{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4} -1265.56{col 67}{space 3} 1636.348
{txt}{space 4}log_re75 {c |}{col 14}{res}{space 2} 472.9503{col 26}{space 2} 505.5981{col 37}{space 1}    0.94{col 46}{space 3}0.350{col 54}{space 4}-520.7943{col 67}{space 3} 1466.695
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-1.688595{col 26}{space 2} 3.982848{col 37}{space 1}   -0.42{col 46}{space 3}0.672{col 54}{space 4}-9.516817{col 67}{space 3} 6.139627
{txt}{space 7}educ2 {c |}{col 14}{res}{space 2} 96.74893{col 26}{space 2} 79.99562{col 37}{space 1}    1.21{col 46}{space 3}0.227{col 54}{space 4}-60.48112{col 67}{space 3}  253.979
{txt}{space 9}u74 {c |}{col 14}{res}{space 2} 2266.514{col 26}{space 2} 6094.477{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4} -9712.08{col 67}{space 3} 14245.11
{txt}{space 9}u75 {c |}{col 14}{res}{space 2} 2227.243{col 26}{space 2} 3977.562{col 37}{space 1}    0.56{col 46}{space 3}0.576{col 54}{space 4}-5590.589{col 67}{space 3} 10045.08
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1827.506{col 26}{space 2} 7159.948{col 37}{space 1}    0.26{col 46}{space 3}0.799{col 54}{space 4}-12245.25{col 67}{space 3} 15900.26
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75 age3 black_u74 educ_log_re74
0

{txt}Linear regression                               Number of obs     = {res}       445
                                                {txt}F(16, 428)        =  {res}     1.77
                                                {txt}Prob > F          = {res}    0.0326
                                                {txt}R-squared         = {res}    0.0598
                                                {txt}Root MSE          =    {res} 6549.1

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Robust HC2
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2} 1501.373{col 26}{space 2} 662.4353{col 37}{space 1}    2.27{col 46}{space 3}0.024{col 54}{space 4}  199.342{col 67}{space 3} 2803.404
{txt}{space 9}age {c |}{col 14}{res}{space 2}-10.72202{col 26}{space 2} 1048.576{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-2071.722{col 67}{space 3} 2050.278
{txt}{space 8}educ {c |}{col 14}{res}{space 2}-1358.338{col 26}{space 2} 1412.734{col 37}{space 1}   -0.96{col 46}{space 3}0.337{col 54}{space 4}-4135.097{col 67}{space 3} 1418.421
{txt}{space 7}black {c |}{col 14}{res}{space 2}-1676.201{col 26}{space 2} 1607.814{col 37}{space 1}   -1.04{col 46}{space 3}0.298{col 54}{space 4}-4836.395{col 67}{space 3} 1483.994
{txt}{space 8}hisp {c |}{col 14}{res}{space 2} 268.8407{col 26}{space 2} 1419.731{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-2521.672{col 67}{space 3} 3059.353
{txt}{space 5}married {c |}{col 14}{res}{space 2}-187.8034{col 26}{space 2}  889.759{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-1936.644{col 67}{space 3} 1561.038
{txt}{space 6}nodegr {c |}{col 14}{res}{space 2} 831.0381{col 26}{space 2} 1408.243{col 37}{space 1}    0.59{col 46}{space 3}0.555{col 54}{space 4}-1936.894{col 67}{space 3}  3598.97
{txt}{space 4}log_re74 {c |}{col 14}{res}{space 2} 225.5374{col 26}{space 2} 855.1082{col 37}{space 1}    0.26{col 46}{space 3}0.792{col 54}{space 4}-1455.197{col 67}{space 3} 1906.272
{txt}{space 4}log_re75 {c |}{col 14}{res}{space 2} 464.4959{col 26}{space 2} 529.7463{col 37}{space 1}    0.88{col 46}{space 3}0.381{col 54}{space 4}-576.7322{col 67}{space 3} 1505.724
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} 3.232564{col 26}{space 2}  33.3009{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4} -62.2211{col 67}{space 3} 68.68622
{txt}{space 7}educ2 {c |}{col 14}{res}{space 2} 99.18165{col 26}{space 2} 83.02583{col 37}{space 1}    1.19{col 46}{space 3}0.233{col 54}{space 4}-64.00745{col 67}{space 3} 262.3707
{txt}{space 9}u74 {c |}{col 14}{res}{space 2} 2798.828{col 26}{space 2} 6389.316{col 37}{space 1}    0.44{col 46}{space 3}0.662{col 54}{space 4}-9759.513{col 67}{space 3} 15357.17
{txt}{space 9}u75 {c |}{col 14}{res}{space 2} 2159.216{col 26}{space 2} 4152.366{col 37}{space 1}    0.52{col 46}{space 3}0.603{col 54}{space 4}-6002.351{col 67}{space 3} 10320.78
{txt}{space 8}age3 {c |}{col 14}{res}{space 2}-.0507141{col 26}{space 2} .3352707{col 37}{space 1}   -0.15{col 46}{space 3}0.880{col 54}{space 4} -.709696{col 67}{space 3} .6082679
{txt}{space 3}black_u74 {c |}{col 14}{res}{space 2}-624.7295{col 26}{space 2} 1709.786{col 37}{space 1}   -0.37{col 46}{space 3}0.715{col 54}{space 4}-3985.351{col 67}{space 3} 2735.892
{txt}educ_log_~74 {c |}{col 14}{res}{space 2}-3.624584{col 26}{space 2} 68.64971{col 37}{space 1}   -0.05{col 46}{space 3}0.958{col 54}{space 4}-138.5571{col 67}{space 3} 131.3079
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2980.407{col 26}{space 2} 12557.09{col 37}{space 1}    0.24{col 46}{space 3}0.813{col 54}{space 4}-21700.84{col 67}{space 3} 27661.65
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}age educ black hisp  married nodegr log_re74 log_re75
2

{txt}Linear regression                               Number of obs     = {res}     2,675
                                                {txt}F(9, 2665)        =  {res}   163.57
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.3693
                                                {txt}Root MSE          =    {res}  12436

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Robust HC2
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2}-6302.395{col 26}{space 2} 1212.457{col 37}{space 1}   -5.20{col 46}{space 3}0.000{col 54}{space 4}-8679.846{col 67}{space 3}-3924.944
{txt}{space 9}age {c |}{col 14}{res}{space 2} 229.2729{col 26}{space 2} 26.74476{col 37}{space 1}    8.57{col 46}{space 3}0.000{col 54}{space 4} 176.8303{col 67}{space 3} 281.7155
{txt}{space 8}educ {c |}{col 14}{res}{space 2} 1617.949{col 26}{space 2} 138.8821{col 37}{space 1}   11.65{col 46}{space 3}0.000{col 54}{space 4} 1345.621{col 67}{space 3} 1890.276
{txt}{space 7}black {c |}{col 14}{res}{space 2}-2871.914{col 26}{space 2} 522.5247{col 37}{space 1}   -5.50{col 46}{space 3}0.000{col 54}{space 4}-3896.509{col 67}{space 3} -1847.32
{txt}{space 8}hisp {c |}{col 14}{res}{space 2} 1608.053{col 26}{space 2} 1513.771{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-1360.231{col 67}{space 3} 4576.337
{txt}{space 5}married {c |}{col 14}{res}{space 2} 2846.252{col 26}{space 2} 638.9316{col 37}{space 1}    4.45{col 46}{space 3}0.000{col 54}{space 4}   1593.4{col 67}{space 3} 4099.104
{txt}{space 6}nodegr {c |}{col 14}{res}{space 2} 512.6371{col 26}{space 2} 779.0908{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 54}{space 4}-1015.047{col 67}{space 3} 2040.321
{txt}{space 4}log_re74 {c |}{col 14}{res}{space 2} 676.3779{col 26}{space 2} 196.1713{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 54}{space 4} 291.7145{col 67}{space 3} 1061.041
{txt}{space 4}log_re75 {c |}{col 14}{res}{space 2}  1551.76{col 26}{space 2} 185.2583{col 37}{space 1}    8.38{col 46}{space 3}0.000{col 54}{space 4} 1188.496{col 67}{space 3} 1915.025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -15050.6{col 26}{space 2} 2913.345{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-20763.25{col 67}{space 3}-9337.955
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75
2

{txt}Linear regression                               Number of obs     = {res}     2,675
                                                {txt}F(13, 2661)       =  {res}   157.20
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5008
                                                {txt}Root MSE          =    {res}  11072

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Robust HC2
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2}-4699.259{col 26}{space 2} 1031.667{col 37}{space 1}   -4.56{col 46}{space 3}0.000{col 54}{space 4}-6722.209{col 67}{space 3}-2676.309
{txt}{space 9}age {c |}{col 14}{res}{space 2} 94.57323{col 26}{space 2} 167.8559{col 37}{space 1}    0.56{col 46}{space 3}0.573{col 54}{space 4}-234.5679{col 67}{space 3} 423.7144
{txt}{space 8}educ {c |}{col 14}{res}{space 2}-836.1368{col 26}{space 2}  353.131{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-1528.576{col 67}{space 3}-143.6977
{txt}{space 7}black {c |}{col 14}{res}{space 2} -1062.58{col 26}{space 2} 474.5828{col 37}{space 1}   -2.24{col 46}{space 3}0.025{col 54}{space 4}-1993.168{col 67}{space 3}-131.9913
{txt}{space 8}hisp {c |}{col 14}{res}{space 2} 2476.267{col 26}{space 2} 1381.528{col 37}{space 1}    1.79{col 46}{space 3}0.073{col 54}{space 4}-232.7114{col 67}{space 3} 5185.245
{txt}{space 5}married {c |}{col 14}{res}{space 2} 658.3175{col 26}{space 2} 566.7132{col 37}{space 1}    1.16{col 46}{space 3}0.245{col 54}{space 4}-452.9254{col 67}{space 3}  1769.56
{txt}{space 6}nodegr {c |}{col 14}{res}{space 2} 731.1991{col 26}{space 2} 695.2207{col 37}{space 1}    1.05{col 46}{space 3}0.293{col 54}{space 4}-632.0284{col 67}{space 3} 2094.427
{txt}{space 4}log_re74 {c |}{col 14}{res}{space 2} 5391.923{col 26}{space 2} 668.9344{col 37}{space 1}    8.06{col 46}{space 3}0.000{col 54}{space 4} 4080.238{col 67}{space 3} 6703.607
{txt}{space 4}log_re75 {c |}{col 14}{res}{space 2} 6208.101{col 26}{space 2}  650.638{col 37}{space 1}    9.54{col 46}{space 3}0.000{col 54}{space 4} 4932.293{col 67}{space 3} 7483.908
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} -1.22687{col 26}{space 2} 2.355382{col 37}{space 1}   -0.52{col 46}{space 3}0.602{col 54}{space 4}-5.845435{col 67}{space 3} 3.391694
{txt}{space 7}educ2 {c |}{col 14}{res}{space 2} 80.48884{col 26}{space 2} 16.15104{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 54}{space 4} 48.81897{col 67}{space 3} 112.1587
{txt}{space 9}u74 {c |}{col 14}{res}{space 2} 47455.91{col 26}{space 2} 5745.427{col 37}{space 1}    8.26{col 46}{space 3}0.000{col 54}{space 4} 36189.95{col 67}{space 3} 58721.86
{txt}{space 9}u75 {c |}{col 14}{res}{space 2} 47412.98{col 26}{space 2} 5546.944{col 37}{space 1}    8.55{col 46}{space 3}0.000{col 54}{space 4} 36536.23{col 67}{space 3} 58289.74
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-85233.25{col 26}{space 2} 5997.528{col 37}{space 1}  -14.21{col 46}{space 3}0.000{col 54}{space 4}-96993.54{col 67}{space 3}-73472.96
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75 age3 black_u74 educ_log_re74
2

{txt}Linear regression                               Number of obs     = {res}     2,675
                                                {txt}F(16, 2658)       =  {res}   132.89
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5033
                                                {txt}Root MSE          =    {res}  11050

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}  Robust HC2
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}treat {c |}{col 14}{res}{space 2}-4284.342{col 26}{space 2} 1037.393{col 37}{space 1}   -4.13{col 46}{space 3}0.000{col 54}{space 4}-6318.521{col 67}{space 3}-2250.163
{txt}{space 9}age {c |}{col 14}{res}{space 2}-1059.942{col 26}{space 2} 876.7216{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-2779.068{col 67}{space 3} 659.1833
{txt}{space 8}educ {c |}{col 14}{res}{space 2}-1331.209{col 26}{space 2} 377.4756{col 37}{space 1}   -3.53{col 46}{space 3}0.000{col 54}{space 4}-2071.384{col 67}{space 3} -591.033
{txt}{space 7}black {c |}{col 14}{res}{space 2}-964.4514{col 26}{space 2} 503.4711{col 37}{space 1}   -1.92{col 46}{space 3}0.056{col 54}{space 4}-1951.686{col 67}{space 3} 22.78334
{txt}{space 8}hisp {c |}{col 14}{res}{space 2} 2439.646{col 26}{space 2}  1383.28{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-272.7686{col 67}{space 3}  5152.06
{txt}{space 5}married {c |}{col 14}{res}{space 2} 763.0913{col 26}{space 2} 567.0477{col 37}{space 1}    1.35{col 46}{space 3}0.179{col 54}{space 4}-348.8081{col 67}{space 3} 1874.991
{txt}{space 6}nodegr {c |}{col 14}{res}{space 2} 601.1295{col 26}{space 2} 703.0349{col 37}{space 1}    0.86{col 46}{space 3}0.393{col 54}{space 4}-777.4213{col 67}{space 3}  1979.68
{txt}{space 4}log_re74 {c |}{col 14}{res}{space 2} 4407.928{col 26}{space 2} 769.8287{col 37}{space 1}    5.73{col 46}{space 3}0.000{col 54}{space 4} 2898.404{col 67}{space 3} 5917.452
{txt}{space 4}log_re75 {c |}{col 14}{res}{space 2} 6122.441{col 26}{space 2}  645.178{col 37}{space 1}    9.49{col 46}{space 3}0.000{col 54}{space 4} 4857.339{col 67}{space 3} 7387.542
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} 32.61742{col 26}{space 2} 25.09866{col 37}{space 1}    1.30{col 46}{space 3}0.194{col 54}{space 4}-16.59746{col 67}{space 3} 81.83231
{txt}{space 7}educ2 {c |}{col 14}{res}{space 2} 73.70905{col 26}{space 2} 16.14733{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} 42.04644{col 67}{space 3} 105.3717
{txt}{space 9}u74 {c |}{col 14}{res}{space 2} 47087.32{col 26}{space 2} 5591.718{col 37}{space 1}    8.42{col 46}{space 3}0.000{col 54}{space 4} 36122.76{col 67}{space 3} 58051.88
{txt}{space 9}u75 {c |}{col 14}{res}{space 2} 46329.74{col 26}{space 2} 5501.581{col 37}{space 1}    8.42{col 46}{space 3}0.000{col 54}{space 4} 35541.92{col 67}{space 3} 57117.55
{txt}{space 8}age3 {c |}{col 14}{res}{space 2}-.3135455{col 26}{space 2} .2293692{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-.7633057{col 67}{space 3} .1362146
{txt}{space 3}black_u74 {c |}{col 14}{res}{space 2}-886.8077{col 26}{space 2}  1434.61{col 37}{space 1}   -0.62{col 46}{space 3}0.537{col 54}{space 4}-3699.873{col 67}{space 3} 1926.257
{txt}educ_log_~74 {c |}{col 14}{res}{space 2} 76.93452{col 26}{space 2} 24.22231{col 37}{space 1}    3.18{col 46}{space 3}0.002{col 54}{space 4} 29.43804{col 67}{space 3}  124.431
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-65376.16{col 26}{space 2} 11396.22{col 37}{space 1}   -5.74{col 46}{space 3}0.000{col 54}{space 4}-87722.52{col 67}{space 3}-43029.81
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *Reg. Impute
. local base_count = `count' 
{txt}
{com}. foreach num of numlist 0 2 {c -(} 
{txt}  2{com}. local count = `base_count'
{txt}  3{com}. 
. foreach cv in a b c {c -(} 
{txt}  4{com}. di "`covars_`cv''"
{txt}  5{com}. di "`num'"
{txt}  6{com}. teffects ra (re78 `covars_`cv'') (treat) if treat ==1 | treat == `num', ate
{txt}  7{com}. local colnmsb: coln e(b)
{txt}  8{com}. local colnmsv: coln e(V)
{txt}  9{com}. local colb: word 1 of `colnmsb'
{txt} 10{com}. local colv: word 1 of `colnmsv'
{txt} 11{com}. mat ate`num'[`count',1] = _b[`colb'] * (1 - `num') // stata thinks 2 is treatment
{txt} 12{com}. mat ate`num'[`count',2] = _se[`colv']
{txt} 13{com}. mat ate`num'[`count',3] = ate`num'[`count',1] - ate`num'[`count',2] * 1.96
{txt} 14{com}. mat ate`num'[`count',4] = ate`num'[`count',1] + ate`num'[`count',2] * 1.96
{txt} 15{com}. 
. teffects ra (re78 `covars_`cv'') (treat) if treat ==1 | treat == `num', atet
{txt} 16{com}. local colnmsb: coln e(b)
{txt} 17{com}. local colnmsv: coln e(V)
{txt} 18{com}. local colb: word 1 of `colnmsb'
{txt} 19{com}. local colv: word 1 of `colnmsv'
{txt} 20{com}. mat att`num'[`count',1] = _b[`colb'] * (1 - `num') // stata thinks 2 is treatment
{txt} 21{com}. mat att`num'[`count',2] = _se[`colv']
{txt} 22{com}. mat att`num'[`count',3] = att`num'[`count',1] - att`num'[`count',2] * 1.96
{txt} 23{com}. mat att`num'[`count',4] = att`num'[`count',1] + att`num'[`count',2] * 1.96
{txt} 24{com}. 
. local ++count 
{txt} 25{com}. {c )-}
{txt} 26{com}. {c )-}
age educ black hisp  married nodegr log_re74 log_re75
0

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.754e-23}  
Iteration 1:{space 3}EE criterion = {res: 5.636e-25}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1462.269{col 26}{space 2} 642.2409{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} 203.5003{col 67}{space 3} 2721.038
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4582.963{col 26}{space 2} 343.2829{col 37}{space 1}   13.35{col 46}{space 3}0.000{col 54}{space 4} 3910.141{col 67}{space 3} 5255.785
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.747e-23}  
Iteration 1:{space 3}EE criterion = {res: 1.782e-25}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1726.602{col 26}{space 2} 688.7638{col 37}{space 1}    2.51{col 46}{space 3}0.012{col 54}{space 4} 376.6498{col 67}{space 3} 3076.554
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4622.541{col 26}{space 2} 377.2156{col 37}{space 1}   12.25{col 46}{space 3}0.000{col 54}{space 4} 3883.212{col 67}{space 3}  5361.87
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75
0

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.245e-20}  
Iteration 1:{space 3}EE criterion = {res: 1.172e-23}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1454.128{col 26}{space 2} 643.4856{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4} 192.9196{col 67}{space 3} 2715.337
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4548.418{col 26}{space 2} 336.1874{col 37}{space 1}   13.53{col 46}{space 3}0.000{col 54}{space 4} 3889.503{col 67}{space 3} 5207.333
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.245e-20}  
Iteration 1:{space 3}EE criterion = {res: 5.919e-24}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1809.697{col 26}{space 2} 693.8674{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4} 449.7416{col 67}{space 3} 3169.652
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4539.447{col 26}{space 2} 372.9208{col 37}{space 1}   12.17{col 46}{space 3}0.000{col 54}{space 4} 3808.535{col 67}{space 3} 5270.358
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75 age3 black_u74 educ_log_re74
0

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.732e-19}  
Iteration 1:{space 3}EE criterion = {res: 2.405e-23}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1427.526{col 26}{space 2} 642.9504{col 37}{space 1}    2.22{col 46}{space 3}0.026{col 54}{space 4} 167.3665{col 67}{space 3} 2687.686
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4533.905{col 26}{space 2} 334.2016{col 37}{space 1}   13.57{col 46}{space 3}0.000{col 54}{space 4} 3878.882{col 67}{space 3} 5188.928
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.732e-19}  
Iteration 1:{space 3}EE criterion = {res: 2.050e-23}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1844.606{col 26}{space 2} 694.8217{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} 482.7804{col 67}{space 3} 3206.431
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4504.538{col 26}{space 2}  373.292{col 37}{space 1}   12.07{col 46}{space 3}0.000{col 54}{space 4} 3772.899{col 67}{space 3} 5236.177
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
age educ black hisp  married nodegr log_re74 log_re75
2

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.638e-19}  
Iteration 1:{space 3}EE criterion = {res: 1.532e-24}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}     2,675
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(2 vs 1)  {c |}{col 14}{res}{space 2} 11195.04{col 26}{space 2} 1741.326{col 37}{space 1}    6.43{col 46}{space 3}0.000{col 54}{space 4}   7782.1{col 67}{space 3} 14607.97
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 8716.503{col 26}{space 2} 1714.906{col 37}{space 1}    5.08{col 46}{space 3}0.000{col 54}{space 4} 5355.349{col 67}{space 3} 12077.66
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.638e-19}  
Iteration 1:{space 3}EE criterion = {res: 2.028e-24}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}     2,675
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(2 vs 1)  {c |}{col 14}{res}{space 2} 12661.53{col 26}{space 2} 1852.755{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4} 9030.197{col 67}{space 3} 16292.86
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 8892.392{col 26}{space 2} 1829.703{col 37}{space 1}    4.86{col 46}{space 3}0.000{col 54}{space 4} 5306.239{col 67}{space 3} 12478.54
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75
2

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 8.363e-17}  
Iteration 1:{space 3}EE criterion = {res: 1.063e-22}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}     2,675
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(2 vs 1)  {c |}{col 14}{res}{space 2} 10398.22{col 26}{space 2}   3293.4{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} 3943.275{col 67}{space 3} 16853.16
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 9763.019{col 26}{space 2}  3288.38{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} 3317.913{col 67}{space 3} 16208.12
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 8.363e-17}  
Iteration 1:{space 3}EE criterion = {res: 9.803e-23}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}     2,675
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(2 vs 1)  {c |}{col 14}{res}{space 2} 11537.26{col 26}{space 2} 3539.268{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} 4600.422{col 67}{space 3}  18474.1
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 10016.66{col 26}{space 2} 3529.353{col 37}{space 1}    2.84{col 46}{space 3}0.005{col 54}{space 4} 3099.257{col 67}{space 3} 16934.06
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75 age3 black_u74 educ_log_re74
2

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 7.587e-17}  
Iteration 1:{space 3}EE criterion = {res: 3.582e-23}  
{err}convergence not achieved
{txt}{p 4 4 2}The Gauss-Newton stopping criterion has been met but missing standard errors indicate some of the parameters are not identified.{p_end}
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}     2,675
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(2 vs 1)  {c |}{col 14}{res}{space 2} 11920.18{col 26}{space 2} 3834.631{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} 4404.441{col 67}{space 3} 19435.92
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 8197.805{col 26}{space 2} 3831.338{col 37}{space 1}    2.14{col 46}{space 3}0.032{col 54}{space 4} 688.5205{col 67}{space 3} 15707.09
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Warning: convergence not achieved

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 7.587e-17}  
Iteration 1:{space 3}EE criterion = {res: 4.235e-23}  
{err}convergence not achieved
{txt}{p 4 4 2}The Gauss-Newton stopping criterion has been met but missing standard errors indicate some of the parameters are not identified.{p_end}
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}     2,675
{txt:Estimator}{col 16}:{res: regression adjustment}
{txt:Outcome model}{col 16}:{res: linear}
{txt:Treatment model}{col 16}:{res: none}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(2 vs 1)  {c |}{col 14}{res}{space 2} 13218.77{col 26}{space 2} 4119.505{col 37}{space 1}    3.21{col 46}{space 3}0.001{col 54}{space 4} 5144.685{col 67}{space 3} 21292.85
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 8335.155{col 26}{space 2} 4111.139{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4}  277.471{col 67}{space 3} 16392.84
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Warning: convergence not achieved

{com}. 
. 
. *IPW 
. local base_count = `count' 
{txt}
{com}. foreach num of numlist 0 2 {c -(} 
{txt}  2{com}. local count = `base_count'
{txt}  3{com}. 
. foreach cv in a b c {c -(} 
{txt}  4{com}. di "`covars_`cv''"
{txt}  5{com}. di "`num'"
{txt}  6{com}. teffects ipw (re78) (treat `covars_`cv'', probit) if treat ==1 | treat == `num', ate
{txt}  7{com}. local colnmsb: coln e(b)
{txt}  8{com}. local colnmsv: coln e(V)
{txt}  9{com}. local colb: word 1 of `colnmsb'
{txt} 10{com}. local colv: word 1 of `colnmsv'
{txt} 11{com}. mat ate`num'[`count',1] = _b[`colb'] * (1 - `num') // stata thinks 2 is treatment
{txt} 12{com}. mat ate`num'[`count',2] = _se[`colv']
{txt} 13{com}. mat ate`num'[`count',3] = ate`num'[`count',1] - ate`num'[`count',2] * 1.96
{txt} 14{com}. mat ate`num'[`count',4] = ate`num'[`count',1] + ate`num'[`count',2] * 1.96
{txt} 15{com}. 
. teffects ipw (re78) (treat `covars_`cv'', probit) if treat ==1 | treat == `num', atet
{txt} 16{com}. local colnmsb: coln e(b)
{txt} 17{com}. local colnmsv: coln e(V)
{txt} 18{com}. local colb: word 1 of `colnmsb'
{txt} 19{com}. local colv: word 1 of `colnmsv'
{txt} 20{com}. mat att`num'[`count',1] = _b[`colb'] * (1 - `num') // stata thinks 2 is treatment
{txt} 21{com}. mat att`num'[`count',2] = _se[`colv']
{txt} 22{com}. mat att`num'[`count',3] = att`num'[`count',1] - att`num'[`count',2] * 1.96
{txt} 23{com}. mat att`num'[`count',4] = att`num'[`count',1] + att`num'[`count',2] * 1.96
{txt} 24{com}. local ++count 
{txt} 25{com}. {c )-}
{txt} 26{com}. {c )-}
age educ black hisp  married nodegr log_re74 log_re75
0

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 4.582e-18}  
Iteration 1:{space 3}EE criterion = {res: 7.356e-25}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: inverse-probability weights}
{txt:Outcome model}{col 16}:{res: weighted mean}
{txt:Treatment model}{col 16}:{res: probit}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1539.436{col 26}{space 2} 646.7719{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} 271.7864{col 67}{space 3} 2807.086
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4566.688{col 26}{space 2} 344.9913{col 37}{space 1}   13.24{col 46}{space 3}0.000{col 54}{space 4} 3890.517{col 67}{space 3} 5242.858
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 4.582e-18}  
Iteration 1:{space 3}EE criterion = {res: 8.137e-26}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: inverse-probability weights}
{txt:Outcome model}{col 16}:{res: weighted mean}
{txt:Treatment model}{col 16}:{res: probit}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1765.855{col 26}{space 2} 697.7973{col 37}{space 1}    2.53{col 46}{space 3}0.011{col 54}{space 4}  398.197{col 67}{space 3} 3133.512
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4583.289{col 26}{space 2} 391.8777{col 37}{space 1}   11.70{col 46}{space 3}0.000{col 54}{space 4} 3815.223{col 67}{space 3} 5351.355
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75
0

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.588e-17}  
Iteration 1:{space 3}EE criterion = {res: 6.860e-26}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: inverse-probability weights}
{txt:Outcome model}{col 16}:{res: weighted mean}
{txt:Treatment model}{col 16}:{res: probit}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1469.953{col 26}{space 2} 646.4215{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4}   202.99{col 67}{space 3} 2736.916
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4576.284{col 26}{space 2} 342.1576{col 37}{space 1}   13.37{col 46}{space 3}0.000{col 54}{space 4} 3905.668{col 67}{space 3} 5246.901
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 1.588e-17}  
Iteration 1:{space 3}EE criterion = {res: 7.871e-25}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: inverse-probability weights}
{txt:Outcome model}{col 16}:{res: weighted mean}
{txt:Treatment model}{col 16}:{res: probit}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1742.791{col 26}{space 2} 701.0295{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} 368.7984{col 67}{space 3} 3116.784
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4606.352{col 26}{space 2} 393.7657{col 37}{space 1}   11.70{col 46}{space 3}0.000{col 54}{space 4} 3834.586{col 67}{space 3} 5378.119
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
age educ black hisp  married nodegr log_re74 log_re75 age2 educ2 u74 u75 age3 black_u74 educ_log_re74
0

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 3.001e-25}  
Iteration 1:{space 3}EE criterion = {res: 1.433e-25}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: inverse-probability weights}
{txt:Outcome model}{col 16}:{res: weighted mean}
{txt:Treatment model}{col 16}:{res: probit}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1467.589{col 26}{space 2} 645.7803{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} 201.8833{col 67}{space 3} 2733.296
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4561.979{col 26}{space 2}  341.542{col 37}{space 1}   13.36{col 46}{space 3}0.000{col 54}{space 4} 3892.569{col 67}{space 3} 5231.389
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 3}EE criterion = {res: 4.269e-23}  
Iteration 1:{space 3}EE criterion = {res: 5.466e-25}  
{res}
{txt}Treatment-effects estimation{col 49}Number of obs {col 67}= {res}       445
{txt:Estimator}{col 16}:{res: inverse-probability weights}
{txt:Outcome model}{col 16}:{res: weighted mean}
{txt:Treatment model}{col 16}:{res: probit}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        re78{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATET         {txt}{c |}
{space 7}treat {c |}
{space 3}(1 vs 0)  {c |}{col 14}{res}{space 2} 1777.066{col 26}{space 2}   700.65{col 37}{space 1}    2.54{col 46}{space 3}0.011{col 54}{space 4} 403.8172{col 67}{space 3} 3150.315
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean       {txt}{c |}
{space 7}treat {c |}
{space 10}0  {c |}{col 14}{res}{space 2} 4572.078{col 26}{space 2} 392.4909{col 37}{space 1}   11.65{col 46}{space 3}0.000{col 54}{space 4} 3802.809{col 67}{space 3} 5341.346
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
age educ black hisp  married nodegr log_re74 log_re75
2
{err}{p}treatment 1 has 512{err} propensity scores less than  1.00e-05{err}{p_end}
{p}treatment overlap assumption has been violated{err}; use option {helpb teffects_ipw##osample:osample}{err}{bf:()} to identify the overlap violators{p_end}
{txt}{search r(498), local:r(498);}

end of do-file

{search r(498), local:r(498);}

{com}. 